IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/C2000/f2838x_sdfm_regs.xml
<module id="SDFM_REGS" HW_revision="" description="SDFM Registers">
	<register id="SDIFLG" width="32" page="1" offset="0x0" internal="0" description="SD Interrupt Flag Register">
		<bitfield id="FLT1_FLG_CEVT1" description="High-level Interrupt flag for Ch1" begin="0" end="0" width="1" rwaccess="R"/>
		<bitfield id="FLT1_FLG_CEVT2" description="Low-level Interrupt flag for Ch1" begin="1" end="1" width="1" rwaccess="R"/>
		<bitfield id="FLT2_FLG_CEVT1" description="High-level Interrupt flag for Ch2" begin="2" end="2" width="1" rwaccess="R"/>
		<bitfield id="FLT2_FLG_CEVT2" description="Low-level Interrupt flag for Ch2" begin="3" end="3" width="1" rwaccess="R"/>
		<bitfield id="FLT3_FLG_CEVT1" description="High-level Interrupt flag for Ch3" begin="4" end="4" width="1" rwaccess="R"/>
		<bitfield id="FLT3_FLG_CEVT2" description="Low-level Interrupt flag for Ch3" begin="5" end="5" width="1" rwaccess="R"/>
		<bitfield id="FLT4_FLG_CEVT1" description="High-level Interrupt flag for Ch4" begin="6" end="6" width="1" rwaccess="R"/>
		<bitfield id="FLT4_FLG_CEVT2" description="Low-level Interrupt flag for Ch4" begin="7" end="7" width="1" rwaccess="R"/>
		<bitfield id="MF1" description="Modulator Failure for Filter 1" begin="8" end="8" width="1" rwaccess="R"/>
		<bitfield id="MF2" description="Modulator Failure for Filter 2" begin="9" end="9" width="1" rwaccess="R"/>
		<bitfield id="MF3" description="Modulator Failure for Filter 3" begin="10" end="10" width="1" rwaccess="R"/>
		<bitfield id="MF4" description="Modulator Failure for Filter 4" begin="11" end="11" width="1" rwaccess="R"/>
		<bitfield id="AF1" description="Acknowledge flag for Filter 1" begin="12" end="12" width="1" rwaccess="R"/>
		<bitfield id="AF2" description="Acknowledge flag for Filter 2" begin="13" end="13" width="1" rwaccess="R"/>
		<bitfield id="AF3" description="Acknowledge flag for Filter 3" begin="14" end="14" width="1" rwaccess="R"/>
		<bitfield id="AF4" description="Acknowledge flag for Filter 4" begin="15" end="15" width="1" rwaccess="R"/>
		<bitfield id="SDFFOVF1" description="FIFO Overflow Flag for Ch1. " begin="16" end="16" width="1" rwaccess="R"/>
		<bitfield id="SDFFOVF2" description="FIFO Overflow Flag for Ch2" begin="17" end="17" width="1" rwaccess="R"/>
		<bitfield id="SDFFOVF3" description="FIFO Overflow Flag for Ch3" begin="18" end="18" width="1" rwaccess="R"/>
		<bitfield id="SDFFOVF4" description="FIFO Overflow Flag for Ch4" begin="19" end="19" width="1" rwaccess="R"/>
		<bitfield id="SDFFINT1" description="SDFIFO interrupt for Ch1 " begin="20" end="20" width="1" rwaccess="R"/>
		<bitfield id="SDFFINT2" description="SDFIFO interrupt for Ch2" begin="21" end="21" width="1" rwaccess="R"/>
		<bitfield id="SDFFINT3" description="SDFIFO interrupt for Ch3" begin="22" end="22" width="1" rwaccess="R"/>
		<bitfield id="SDFFINT4" description="SDFIFO interrupt for Ch4" begin="23" end="23" width="1" rwaccess="R"/>
		<bitfield id="MIF" description="Master Interrupt Flag" begin="31" end="31" width="1" rwaccess="R"/>
	</register>
	<register id="SDIFLGCLR" width="32" page="1" offset="0x2" internal="0" description="SD Interrupt Flag Clear Register">
		<bitfield id="FLT1_FLG_CEVT1" description="High-level Interrupt flag for Ch1" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="FLT1_FLG_CEVT2" description="Low-level Interrupt flag for Ch1" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="FLT2_FLG_CEVT1" description="High-level Interrupt flag for Ch2" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="FLT2_FLG_CEVT2" description="Low-level Interrupt flag for Ch2" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="FLT3_FLG_CEVT1" description="High-level Interrupt flag for Ch3" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="FLT3_FLG_CEVT2" description="Low-level Interrupt flag for Ch3" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="FLT4_FLG_CEVT1" description="High-level Interrupt flag for Ch4" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="FLT4_FLG_CEVT2" description="Low-level Interrupt flag for Ch4" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="MF1" description="Modulator Failure for Filter 1" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="MF2" description="Modulator Failure for Filter 2" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="MF3" description="Modulator Failure for Filter 3" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="MF4" description="Modulator Failure for Filter 4" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="AF1" description="Acknowledge flag for Filter 1" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="AF2" description="Acknowledge flag for Filter 2" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="AF3" description="Acknowledge flag for Filter 3" begin="14" end="14" width="1" rwaccess="RW"/>
		<bitfield id="AF4" description="Acknowledge flag for Filter 4" begin="15" end="15" width="1" rwaccess="RW"/>
		<bitfield id="SDFFOVF1" description="SDFIFO overflow clear Ch1" begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="SDFFOVF2" description="SDFIFO overflow clear Ch2" begin="17" end="17" width="1" rwaccess="RW"/>
		<bitfield id="SDFFOVF3" description="SDFIFO overflow clear Ch3" begin="18" end="18" width="1" rwaccess="RW"/>
		<bitfield id="SDFFOVF4" description="SDFIFO overflow clear Ch4" begin="19" end="19" width="1" rwaccess="RW"/>
		<bitfield id="SDFFINT1" description="SDFIFO Interrupt flag-clear bit for Ch1" begin="20" end="20" width="1" rwaccess="RW"/>
		<bitfield id="SDFFINT2" description="SDFIFO Interrupt flag-clear bit for Ch2" begin="21" end="21" width="1" rwaccess="RW"/>
		<bitfield id="SDFFINT3" description="SDFIFO Interrupt flag-clear bit for Ch3" begin="22" end="22" width="1" rwaccess="RW"/>
		<bitfield id="SDFFINT4" description="SDFIFO Interrupt flag-clear bit for Ch4" begin="23" end="23" width="1" rwaccess="RW"/>
		<bitfield id="MIF" description="Master Interrupt Flag" begin="31" end="31" width="1" rwaccess="RW"/>
	</register>
	<register id="SDCTL" width="16" page="1" offset="0x4" internal="0" description="SD Control Register">
		<bitfield id="HZ1" description="High-level Threshold crossing (Z) flag Ch1" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="HZ2" description="High-level Threshold crossing (Z) flag Ch2" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="HZ3" description="High-level Threshold crossing (Z) flag Ch3" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="HZ4" description="High-level Threshold crossing (Z) flag Ch4" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="MIE" description="Master SDy_ERR Interrupt enable" begin="13" end="13" width="1" rwaccess="RW"/>
	</register>
	<register id="SDMFILEN" width="16" page="1" offset="0x6" internal="0" description="SD Master Filter Enable">
		<bitfield id="MFE" description="Master Filter Enable. " begin="11" end="11" width="1" rwaccess="RW"/>
	</register>
	<register id="SDSTATUS" width="16" page="1" offset="0x7" internal="0" description="SD Status Register">
		<bitfield id="HZ1" description="High-level Threshold crossing (Z) flag Ch1" begin="0" end="0" width="1" rwaccess="R"/>
		<bitfield id="HZ2" description="High-level Threshold crossing (Z) flag Ch2" begin="1" end="1" width="1" rwaccess="R"/>
		<bitfield id="HZ3" description="High-level Threshold crossing (Z) flag Ch3" begin="2" end="2" width="1" rwaccess="R"/>
		<bitfield id="HZ4" description="High-level Threshold crossing (Z) flag Ch4" begin="3" end="3" width="1" rwaccess="R"/>
		<bitfield id="MS1" description="Manchester  clock decode phase complete for filter module 1." begin="8" end="8" width="1" rwaccess="R"/>
		<bitfield id="MS2" description="Manchester  clock decode phase complete for filter module 2." begin="9" end="9" width="1" rwaccess="R"/>
		<bitfield id="MS3" description="Manchester  clock decode phase complete for filter module 3." begin="10" end="10" width="1" rwaccess="R"/>
		<bitfield id="MS4" description="Manchester  clock decode phase complete for filter module 4." begin="11" end="11" width="1" rwaccess="R"/>
		<bitfield id="MAL1" description="Manchester locked status for filter module 1." begin="12" end="12" width="1" rwaccess="R"/>
		<bitfield id="MAL2" description="Manchester locked status for filter module 2." begin="13" end="13" width="1" rwaccess="R"/>
		<bitfield id="MAL3" description="Manchester locked status for filter module 3." begin="14" end="14" width="1" rwaccess="R"/>
		<bitfield id="MAL4" description="Manchester locked status for filter module 4." begin="15" end="15" width="1" rwaccess="R"/>
	</register>
